In [1]:
import pandas as pd
import numpy as np

In [2]:
dict={
    "name":["ashish","Rohan","jai","sohan","hari","raj","sikander","subash"],
    "marks":[43,55,33,62,62,71,33,44],
    "age":[12,22,42,22,33,22,22,33],
    "city":["gopalganj","siwan","kuchakote","gopalganj","patna","aara","boxer","darbhanga"]
}

In [3]:
data=pd.DataFrame(dict)

In [4]:
data

       name  marks  age       city
0    ashish     43   12  gopalganj
1     Rohan     55   22      siwan
2       jai     33   42  kuchakote
3     sohan     62   22  gopalganj
4      hari     62   33      patna
5       raj     71   22       aara
6  sikander     33   22      boxer
7    subash     44   33  darbhanga

In [5]:
data.to_csv("ashish.csv")

In [6]:
data.head(2)

     name  marks  age       city
0  ashish     43   12  gopalganj
1   Rohan     55   22      siwan

In [7]:
data.tail(2)

       name  marks  age       city
6  sikander     33   22      boxer
7    subash     44   33  darbhanga

In [8]:
data.describe()

          marks        age
count   8.00000   8.000000
mean   50.37500  26.000000
std    14.22209   9.365591
min    33.00000  12.000000
25%    40.50000  22.000000
50%    49.50000  22.000000
75%    62.00000  33.000000
max    71.00000  42.000000

In [9]:
data['age']

0    12
1    22
2    42
3    22
4    33
5    22
6    22
7    33
Name: age, dtype: int64

In [10]:
data['age'][0]

12

In [11]:
data['age'][0]=55

C:\Users\Ashish Kumar Singh\AppData\Local\Temp\ipykernel_18980\1160968009.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['age'][0]=55

In [12]:
data

       name  marks  age       city
0    ashish     43   55  gopalganj
1     Rohan     55   22      siwan
2       jai     33   42  kuchakote
3     sohan     62   22  gopalganj
4      hari     62   33      patna
5       raj     71   22       aara
6  sikander     33   22      boxer
7    subash     44   33  darbhanga